//
//  AboutUs.swift
//  e-commerce
//
//  Created by Macbook on 10/03/2023.
//

import Foundation
import UIKit


struct AboutUs : Codable{
    
    var status : Bool?
    var message : String?
    var data : About?
}
struct About : Codable{
    var about : String?
    var terms : String?
}
/* "status": true,
 "message": null,
 "data": {
     "about": "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. الهدف من استخدام Lorem Ipsum هو أنه يحتوي على توزيع طبيعي -إلى حد ما- للأحرف ، بدلاً من استخدام المحتوى هنا ، والمحتوى هنا ، مما يجعله يبدو وكأنه إنجليزي قابل للقراءة. تستخدم العديد من حزم النشر المكتبي ومحرري صفحات الويب الآن Lorem Ipsum كنص نموذج افتراضي ، وسيكشف البحث عن lorem ipsum عن العديد من مواقع الويب التي لا تزال في مهدها. تطورت إصدارات مختلفة على مر السنين ، أحيانًا عن طريق الصدفة ، وأحيانًا عن قصد (الفكاهة المحقونة وما شابه)",
     "terms": "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. الهدف من استخدام Lorem Ipsum هو أنه يحتوي على توزيع طبيعي -إلى حد ما- للأحرف ، بدلاً من استخدام المحتوى هنا ، والمحتوى هنا ، مما يجعله يبدو وكأنه إنجليزي قابل للقراءة. تستخدم العديد من حزم النشر المكتبي ومحرري صفحات الويب الآن Lorem Ipsum كنص نموذج افتراضي ، وسيكشف البحث عن lorem ipsum عن العديد من مواقع الويب التي لا تزال في مهدها. تطورت إصدارات مختلفة على مر السنين ، أحيانًا عن طريق الصدفة ، وأحيانًا عن قصد (الفكاهة المحقونة وما شابه)"
 }
}*/
